<details>
<summary>Execution result of "plan" in "./environments/dev"</summary>

```terraform
23:40:10.732 STDOUT terraform: Terraform used the selected providers to generate the following execution
23:40:10.732 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
23:40:10.732 STDOUT terraform:   + create
23:40:10.732 STDOUT terraform: Terraform will perform the following actions:
23:40:10.732 STDOUT terraform:   # aws_instance.terragrunt_instance will be created
23:40:10.732 STDOUT terraform:   + resource "aws_instance" "terragrunt_instance" {
23:40:10.732 STDOUT terraform:       + ami                                  = "ami-0f88e80871fd81e91"
23:40:10.732 STDOUT terraform:       + arn                                  = (known after apply)
23:40:10.732 STDOUT terraform:       + associate_public_ip_address          = (known after apply)
23:40:10.732 STDOUT terraform:       + availability_zone                    = (known after apply)
23:40:10.732 STDOUT terraform:       + cpu_core_count                       = (known after apply)
23:40:10.732 STDOUT terraform:       + cpu_threads_per_core                 = (known after apply)
23:40:10.732 STDOUT terraform:       + disable_api_stop                     = (known after apply)
23:40:10.732 STDOUT terraform:       + disable_api_termination              = (known after apply)
23:40:10.732 STDOUT terraform:       + ebs_optimized                        = (known after apply)
23:40:10.732 STDOUT terraform:       + enable_primary_ipv6                  = (known after apply)
23:40:10.732 STDOUT terraform:       + get_password_data                    = false
23:40:10.732 STDOUT terraform:       + host_id                              = (known after apply)
23:40:10.732 STDOUT terraform:       + host_resource_group_arn              = (known after apply)
23:40:10.732 STDOUT terraform:       + iam_instance_profile                 = (known after apply)
23:40:10.732 STDOUT terraform:       + id                                   = (known after apply)
23:40:10.732 STDOUT terraform:       + instance_initiated_shutdown_behavior = (known after apply)
23:40:10.732 STDOUT terraform:       + instance_lifecycle                   = (known after apply)
23:40:10.732 STDOUT terraform:       + instance_state                       = (known after apply)
23:40:10.732 STDOUT terraform:       + instance_type                        = "t2.micro"
23:40:10.732 STDOUT terraform:       + ipv6_address_count                   = (known after apply)
23:40:10.732 STDOUT terraform:       + ipv6_addresses                       = (known after apply)
23:40:10.732 STDOUT terraform:       + key_name                             = (known after apply)
23:40:10.732 STDOUT terraform:       + monitoring                           = (known after apply)
23:40:10.732 STDOUT terraform:       + outpost_arn                          = (known after apply)
23:40:10.732 STDOUT terraform:       + password_data                        = (known after apply)
23:40:10.732 STDOUT terraform:       + placement_group                      = (known after apply)
23:40:10.732 STDOUT terraform:       + placement_partition_number           = (known after apply)
23:40:10.732 STDOUT terraform:       + primary_network_interface_id         = (known after apply)
23:40:10.732 STDOUT terraform:       + private_dns                          = (known after apply)
23:40:10.732 STDOUT terraform:       + private_ip                           = (known after apply)
23:40:10.732 STDOUT terraform:       + public_dns                           = (known after apply)
23:40:10.732 STDOUT terraform:       + public_ip                            = (known after apply)
23:40:10.732 STDOUT terraform:       + secondary_private_ips                = (known after apply)
23:40:10.732 STDOUT terraform:       + security_groups                      = (known after apply)
23:40:10.732 STDOUT terraform:       + source_dest_check                    = true
23:40:10.732 STDOUT terraform:       + spot_instance_request_id             = (known after apply)
23:40:10.732 STDOUT terraform:       + subnet_id                            = (known after apply)
23:40:10.732 STDOUT terraform:       + tags                                 = {
23:40:10.732 STDOUT terraform:           + "Name" = "terragrunt_instance"
23:40:10.732 STDOUT terraform:         }
23:40:10.732 STDOUT terraform:       + tags_all                             = {
23:40:10.732 STDOUT terraform:           + "Name" = "terragrunt_instance"
23:40:10.732 STDOUT terraform:         }
23:40:10.732 STDOUT terraform:       + tenancy                              = (known after apply)
23:40:10.732 STDOUT terraform:       + user_data                            = (known after apply)
23:40:10.732 STDOUT terraform:       + user_data_base64                     = (known after apply)
23:40:10.732 STDOUT terraform:       + user_data_replace_on_change          = false
23:40:10.732 STDOUT terraform:       + vpc_security_group_ids               = (known after apply)
23:40:10.732 STDOUT terraform:       + capacity_reservation_specification (known after apply)
23:40:10.732 STDOUT terraform:       + cpu_options (known after apply)
23:40:10.732 STDOUT terraform:       + ebs_block_device (known after apply)
23:40:10.732 STDOUT terraform:       + enclave_options (known after apply)
23:40:10.732 STDOUT terraform:       + ephemeral_block_device (known after apply)
23:40:10.732 STDOUT terraform:       + instance_market_options (known after apply)
23:40:10.732 STDOUT terraform:       + maintenance_options (known after apply)
23:40:10.733 STDOUT terraform:       + metadata_options (known after apply)
23:40:10.733 STDOUT terraform:       + network_interface (known after apply)
23:40:10.733 STDOUT terraform:       + private_dns_name_options (known after apply)
23:40:10.733 STDOUT terraform:       + root_block_device (known after apply)
23:40:10.733 STDOUT terraform:     }
23:40:10.733 STDOUT terraform: Plan: 1 to add, 0 to change, 0 to destroy.
23:40:10.733 STDOUT terraform: 
23:40:10.733 STDOUT terraform: Changes to Outputs:
23:40:10.733 STDOUT terraform:   + public_ip = (known after apply)
```

</details>
    
